YellowstonePathology/Business/MaterialTracking.Model/FedexProcessShipmentRequest.v15.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v15="http://fedex.com/ws/ship/v15">
  <soapenv:Header/>
  <soapenv:Body>
    <v15:ProcessShipmentRequest>
      <v15:WebAuthenticationDetail>
        <v15:UserCredential>
          <v15:Key></v15:Key>
          <v15:Password></v15:Password>
        </v15:UserCredential>
      </v15:WebAuthenticationDetail>
      <v15:ClientDetail>
        <v15:AccountNumber></v15:AccountNumber>
        <v15:MeterNumber></v15:MeterNumber>
      </v15:ClientDetail>
      <v15:TransactionDetail>
        <v15:CustomerTransactionId>ProcessShipmentRequest_v15</v15:CustomerTransactionId>
      </v15:TransactionDetail>
      <v15:Version>
        <v15:ServiceId>ship</v15:ServiceId>
        <v15:Major>15</v15:Major>
        <v15:Intermediate>0</v15:Intermediate>
        <v15:Minor>0</v15:Minor>
      </v15:Version>
      <v15:RequestedShipment>
        <v15:ShipTimestamp>2016-08-25T16:30:12</v15:ShipTimestamp>
        <v15:DropoffType>REGULAR_PICKUP</v15:DropoffType>
        <v15:ServiceType>PRIORITY_OVERNIGHT</v15:ServiceType>
        <v15:PackagingType>YOUR_PACKAGING</v15:PackagingType>
        <v15:PreferredCurrency>USD</v15:PreferredCurrency>
        <v15:Shipper>
          <v15:Contact>
            <v15:PersonName></v15:PersonName>
            <v15:CompanyName>Yellowstone Pathology Institute</v15:CompanyName>
            <v15:PhoneNumber>4062386360</v15:PhoneNumber>
            <v15:EMailAddress>support@ypii.com</v15:EMailAddress>
          </v15:Contact>
          <v15:Address>
            <v15:StreetLines>2900 12th Ave. N.</v15:StreetLines>
            <v15:StreetLines>Suite 295W</v15:StreetLines>
            <v15:City>Billings</v15:City>
            <v15:StateOrProvinceCode>MT</v15:StateOrProvinceCode>
            <v15:PostalCode>59102</v15:PostalCode>
            <v15:CountryCode>US</v15:CountryCode>
          </v15:Address>
        </v15:Shipper>
        <v15:Recipient>
          <v15:Contact>
            <v15:PersonName></v15:PersonName>
            <v15:CompanyName></v15:CompanyName>
            <v15:PhoneNumber></v15:PhoneNumber>
            <v15:EMailAddress></v15:EMailAddress>
          </v15:Contact>
          <v15:Address>
            <v15:StreetLines></v15:StreetLines>
            <v15:StreetLines></v15:StreetLines>
            <v15:City></v15:City>
            <v15:StateOrProvinceCode></v15:StateOrProvinceCode>
            <v15:PostalCode></v15:PostalCode>
            <v15:CountryCode></v15:CountryCode>
          </v15:Address>
        </v15:Recipient>
        <v15:ShippingChargesPayment>
          <v15:PaymentType>SENDER</v15:PaymentType>
          <v15:Payor>
            <v15:ResponsibleParty>
              <v15:AccountNumber>235542196</v15:AccountNumber>
              <v15:Tins>
                <v15:TinType>BUSINESS_STATE</v15:TinType>
                <v15:Number>81-0518775</v15:Number>
              </v15:Tins>
              <v15:Contact>
                <v15:ContactId>ypisid</v15:ContactId>
                <v15:PersonName>Sid Harder</v15:PersonName>
              </v15:Contact>
            </v15:ResponsibleParty>
          </v15:Payor>
        </v15:ShippingChargesPayment>
        <v15:CustomsClearanceDetail>
          <v15:DutiesPayment>
            <v15:PaymentType>SENDER</v15:PaymentType>
            <v15:Payor>
              <v15:ResponsibleParty>
                <v15:AccountNumber>235542196</v15:AccountNumber>
                <v15:Tins>
                  <v15:TinType>BUSINESS_STATE</v15:TinType>
                  <v15:Number>>81-0518775</v15:Number>
                </v15:Tins>
                <v15:Contact>
                  <v15:ContactId>ypisid</v15:ContactId>
                  <v15:PersonName>Sid Harder</v15:PersonName>
                </v15:Contact>
              </v15:ResponsibleParty>
            </v15:Payor>
          </v15:DutiesPayment>
          <v15:DocumentContent>DOCUMENTS_ONLY</v15:DocumentContent>
          <v15:CustomsValue>
            <v15:Currency>USD</v15:Currency>
            <v15:Amount>100.00</v15:Amount>
          </v15:CustomsValue>
          <v15:CommercialInvoice>
            <v15:TermsOfSale>FOB</v15:TermsOfSale>
          </v15:CommercialInvoice>
          <v15:Commodities>
            <v15:NumberOfPieces>1</v15:NumberOfPieces>
            <v15:Description>ABCD</v15:Description>
            <v15:CountryOfManufacture>US</v15:CountryOfManufacture>
            <v15:Weight>
              <v15:Units>LB</v15:Units>
              <v15:Value>1.0</v15:Value>
            </v15:Weight>
            <v15:Quantity>1</v15:Quantity>
            <v15:QuantityUnits>cm</v15:QuantityUnits>
            <v15:UnitPrice>
              <v15:Currency>USD</v15:Currency>
              <v15:Amount>1.000000</v15:Amount>
            </v15:UnitPrice>
            <v15:CustomsValue>
              <v15:Currency>USD</v15:Currency>
              <v15:Amount>100.000000</v15:Amount>
            </v15:CustomsValue>
          </v15:Commodities>
          <v15:ExportDetail>
            <v15:ExportComplianceStatement>30.37(f)</v15:ExportComplianceStatement>
          </v15:ExportDetail>
        </v15:CustomsClearanceDetail>
        <v15:LabelSpecification>
          <v15:LabelFormatType>COMMON2D</v15:LabelFormatType>
          <v15:ImageType>ZPLII</v15:ImageType>
          <v15:LabelStockType>STOCK_4X6</v15:LabelStockType>
        </v15:LabelSpecification>
        <v15:RateRequestTypes>LIST</v15:RateRequestTypes>
        <v15:PackageCount>1</v15:PackageCount>
        <v15:RequestedPackageLineItems>
          <v15:SequenceNumber>1</v15:SequenceNumber>
          <v15:Weight>
            <v15:Units>LB</v15:Units>
            <v15:Value>20.0</v15:Value>
          </v15:Weight>
          <v15:Dimensions>
            <v15:Length>12</v15:Length>
            <v15:Width>12</v15:Width>
            <v15:Height>12</v15:Height>
            <v15:Units>IN</v15:Units>
          </v15:Dimensions>
          <v15:CustomerReferences>
            <v15:CustomerReferenceType>CUSTOMER_REFERENCE</v15:CustomerReferenceType>
            <v15:Value>string</v15:Value>
          </v15:CustomerReferences>
        </v15:RequestedPackageLineItems>
      </v15:RequestedShipment>
    </v15:ProcessShipmentRequest>
  </soapenv:Body>
</soapenv:Envelope>